Revit 2024 API
Macro Members
The Macro type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Macro
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Execute
 Executes the macro.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Description
 The macro description.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroModule
 The Macro module.
Name
 The macro name.
See Also
Macro Class
Autodesk.Revit.DB.Macros Namespace